coocox/Mplib/Toshaba/TMPM36x/TMPM361/cmsis_lib/lib/source/tmpm361_cg.c
#if defined(__TMPM360_CG_H) || defined(__TMPM361_CG_H)|| defined(__TMPM362_CG_H) || defined(__TMPM364_CG_H)
        case 3:                /* IMCGD */
            regval[3].byte4 = TSB_CG->IMCGD;
            regval[3].byte[j] &= 0x8eU;
            regval[3].byte[j] |= ActiveState;
            TSB_CG->IMCGD = regval[3].byte4;
            regval[3].byte[j] |= NewState;
            TSB_CG->IMCGD = regval[3].byte4;
            break;
#endif

        case 4:                /* IMCGE */
            regval[4].byte4 = TSB_CG->IMCGE;
            regval[4].byte[j] &= 0x8eU;
            ActiveState = CG_INT_ACTIVE_STATE_RISING;
            regval[4].byte[j] |= ActiveState;
            TSB_CG->IMCGE = regval[4].byte4;
            regval[4].byte[j] |= NewState;
            TSB_CG->IMCGE = regval[4].byte4;
            break;

        case 5:                /* IMCGF */
            regval[5].byte4 = TSB_CG->IMCGF;
            regval[5].byte[j] &= 0x8eU;
            if (INTSource == CG_INT_SRC_RTC) {
                ActiveState = CG_INT_ACTIVE_STATE_FALLING;
            } else {
                ActiveState = CG_INT_ACTIVE_STATE_H;
            }
            regval[5].byte[j] |= ActiveState;
            TSB_CG->IMCGF = regval[5].byte4;
            regval[5].byte[j] |= NewState;
            TSB_CG->IMCGF = regval[5].byte4;
            break;

        default:
            /* Do nothing */
            break;
        }
    } else {
        /*Do nothing */
    }
}

/**
  * @brief  gets the active state of INT source standby clear request
  * @param  INTSource: select the release INT source
  *   This parameter can be one of the following values:
  *   CG_INT_SRC_0, CG_INT_SRC_1, CG_INT_SRC_2, CG_INT_SRC_3,     
  *   CG_INT_SRC_4, CG_INT_SRC_5, CG_INT_SRC_6, CG_INT_SRC_7, 
  *   CG_INT_SRC_8(For M360/M362/M364), CG_INT_SRC_9(For M360/M362/M364),
  *   CG_INT_SRC_A(For M360/M362/M364), CG_INT_SRC_B(For M360/M362/M364), 
  *   CG_INT_SRC_C(For M360/M362/M364), CG_INT_SRC_D(For M360/M362/M364),
  *   CG_INT_SRC_E(For M360/M361/M362), CG_INT_SRC_F(For M360/M361/M362), 
  *   CG_INT_SRC_CEC_RX , CG_INT_SRC_CEC_TX, CG_INT_SRC_RMC_RX_0,  
  *   CG_INT_SRC_RMC_RX_1(For M360/M362/M364), CG_INT_SRC_RTC, CG_INT_SRC_KWUP.
  * @retval active state of the input INT
  *   The value returned can be one of the following values:
  *   CG_INT_ACTIVE_STATE_FALLING, CG_INT_ACTIVE_STATE_RISING,
  *   CG_INT_ACTIVE_STATE_BOTH_EDGES or CG_INT_ACTIVE_STATE_INVALID.
  */
CG_INTActiveState CG_GetSTBYReleaseINTState(CG_INTSrc INTSource)
{
    CG_INTActiveState int_active_state = CG_INT_ACTIVE_STATE_INVALID;
    CG_Byte4 regval[6] = { {0U}
    , {0U}
    , {0U}
    , {0U}
    , {0U}
    , {0U}
    };
    uint8_t i = 0U;
    uint8_t j = 0U;
    uint8_t tmp = 0U;
    uint32_t num = 0U;

    /* Check the parameters */
    assert_param(IS_CG_INT_SRC(INTSource));

    if (INTSource <= CG_INT_SRC_KWUP) {
        regval[0].byte4 = TSB_CG->IMCGA;
        regval[1].byte4 = TSB_CG->IMCGB;
#if defined(__TMPM360_CG_H) || defined(__TMPM362_CG_H) || defined(__TMPM364_CG_H)
        regval[2].byte4 = TSB_CG->IMCGC;
#endif
#if defined(__TMPM360_CG_H) || defined(__TMPM361_CG_H)|| defined(__TMPM362_CG_H) || defined(__TMPM364_CG_H)
        regval[3].byte4 = TSB_CG->IMCGD;
#endif
        regval[4].byte4 = TSB_CG->IMCGE;
        regval[5].byte4 = TSB_CG->IMCGF;
        num = (uint32_t) INTSource;
        i = (uint8_t) (num / 4U);
        j = (uint8_t) (num % 4U);

        tmp = regval[i].byte[j];
        tmp &= 0x0CU;

        switch (tmp) {
        case 0x04U:
            int_active_state = CG_INT_ACTIVE_STATE_RISING;
            break;
        case 0x08U:
            int_active_state = CG_INT_ACTIVE_STATE_FALLING;
            break;
        case 0x0CU:
            int_active_state = CG_INT_ACTIVE_STATE_BOTH_EDGES;
            break;
        default:
            /* Do nothing */
            break;
        }
    }
    return (int_active_state);
}

/**
  * @brief  clears the input INT request.
  * @param  INTSource: select the release INT source
  *   This parameter can be one of the following values:
  *   CG_INT_SRC_0, CG_INT_SRC_1, CG_INT_SRC_2, CG_INT_SRC_3,     
  *   CG_INT_SRC_4, CG_INT_SRC_5, CG_INT_SRC_6, CG_INT_SRC_7, 
  *   CG_INT_SRC_8(For M360/M362/M364), CG_INT_SRC_9(For M360/M362/M364),
  *   CG_INT_SRC_A(For M360/M362/M364), CG_INT_SRC_B(For M360/M362/M364), 
  *   CG_INT_SRC_C(For M360/M362/M364), CG_INT_SRC_D(For M360/M362/M364),
  *   CG_INT_SRC_E(For M360/M361/M362), CG_INT_SRC_F(For M360/M361/M362), 
  *   CG_INT_SRC_CEC_RX , CG_INT_SRC_CEC_TX, CG_INT_SRC_RMC_RX_0,  
  *   CG_INT_SRC_RMC_RX_1(For M360/M362/M364), CG_INT_SRC_RTC, CG_INT_SRC_KWUP.
  * @retval none
  */
void CG_ClearINTReq(CG_INTSrc INTSource)
{
    uint32_t regval = INTSource;

    /* Check the parameters */
    assert_param(IS_CG_INT_SRC(INTSource));

    TSB_CG->ICRCG = regval;
}

/**
  * @brief  gets the NMI flag that shows who triggered NMI.
  * @param  none
  * @retval NMI flag
  */
CG_NMIFactor CG_GetNMIFlag(void)
{
    CG_NMIFactor cg_nmi_factor = { 0U };
    uint32_t regval = TSB_CG->NMIFLG;
    uint32_t tmp = 0U;

    tmp = regval & (~CG_NMI_FACTOR_PIN_WDT_MASK);
    cg_nmi_factor.All = tmp;
    return cg_nmi_factor;
}

/**
  * @brief  get the type of reset reason and clear the reset flag.
  * @param  none
  * @retval reset flag
  */
CG_ResetFlag CG_GetResetFlag(void)
{
    CG_ResetFlag reset_flag = { 0U };
    reset_flag.All = TSB_CG->RSTFLG & (~CG_RESET_FLAG_MASK);
    TSB_CG->RSTFLG = 0U;
    return reset_flag;
}

/** @} */
/* End of group CG_Exported_Functions */

/** @} */
/* End of group CG */

/** @} */
/* End of group TX03_Periph_Driver */
#endif                          /* defined(__TMPM360_CG_H) || defined(__TMPM361_CG_H) || \ */
                                /* defined(__TMPM362_CG_H) || defined(__TMPM363_CG_H) || \ */
                                /* defined(__TMPM364_CG_H) */
